backend/DataProcessors/ВыгрузитьСписокИнициатив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузитьСписокИнициатив</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

backend/InformationRegisters/РейтингИнициатив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>РейтингИнициатив</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОценкаЛайк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОценкаДизЛайк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инициатива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инициатива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователь</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

backend/Catalogs/Инициатива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Инициатива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступностьЮрЛицам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступностьФизЛицам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

backend/DataProcessors/ВыгрузитьСписокИнициатив/Ext/ObjectModule.bsl
Функция  СформироватьСписокИнициатив(Параметры)  Экспорт 

	
	Результат = Новый Структура("КодОтвета, Сообщение, СообщениеОбОшибке");
	ИмяФайлаВыгрузки = КаталогВременныхФайлов() + "\123.json";     
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Инициатива.Ссылка КАК Ссылка,
	               |	Инициатива.Наименование КАК Наименование,
	               |	Инициатива.Содержание КАК Содержание,
	               |	Инициатива.СрокДо КАК СрокДо,
	               |	Инициатива.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	               |	Инициатива.ДоступностьФизЛицам КАК ДоступностьФизЛицам
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Справочник.Инициатива КАК Инициатива
	               |ГДЕ
	               |	Инициатива.СрокДо >= &ТекущаяДата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Ссылка КАК Ссылка,
	               |	ВТ.Наименование КАК Наименование,
	               |	ВТ.Содержание КАК Содержание,
	               |	ВТ.СрокДо КАК СрокДо,
	               |	ВТ.ДоступностьЮрЛицам КАК ДоступностьЮрЛицам,
	               |	ВТ.ДоступностьФизЛицам КАК ДоступностьФизЛицам,
	               |	РейтингИнициатив.ОценкаЛайк КАК ОценкаЛайк,
	               |	РейтингИнициатив.ОценкаДизЛайк КАК ОценкаДизЛайк
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РейтингИнициатив КАК РейтингИнициатив
	               |		ПО ВТ.Ссылка = РейтингИнициатив.Инициатива
	               |ГДЕ
	               |	(ВТ.ДоступностьФизЛицам = &ДоступностьФизЛицам
	               |			ИЛИ ВТ.ДоступностьЮрЛицам = ВТ.ДоступностьФизЛицам)";	
	
	
	Запрос.УстановитьПараметр("ДоступностьФизЛицам",Параметры.ФизЮрЛицо);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
 	
	
	
	РезЗапроса = Запрос.Выполнить();
	Если РезЗапроса.Пустой() Тогда 

		
		
		Инициатива = Новый Структура;
		Инициатива.Вставить("Ошибка", "Не найдено инициатив");
		
		ЗаписьJSON = Новый ЗаписьJSON; 
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(); 
		ЗаписьJSON.ОткрытьФайл(ИмяФайлаВыгрузки, , , ПараметрыЗаписи) ; 
		ЗаписатьJSON(ЗаписьJSON, Инициатива); 
		ЗаписьJSON.Закрыть();
		
		ТекстДок = Новый ТекстовыйДокумент();
		ТекстДок.Прочитать(ИмяФайлаВыгрузки,КодировкаТекста.UTF8);
		
		
		Результат.Вставить("Сообщение", ТекстДок.ПолучитьТекст());

		Возврат Результат;
	КонецЕсли;
	
	
	Выборка = РезЗапроса.Выбрать();
	
	Инициатива = Новый Структура;
	
	Пока Выборка.Следующий() Цикл 
		//РезультатПр  ПроверитьТранзакциюПоДокументуНаСервере(Выборка.Ссылка);
		Инициатива.Вставить("Наименование",Выборка.Наименование);
		Инициатива.Вставить("ОценкаЛайк",Выборка.ОценкаЛайк);
		Инициатива.Вставить("ОценкаДизЛайк",Выборка.ОценкаДизЛайк);
		Инициатива.Вставить("ДоступностьЮрЛицам",Выборка.ДоступностьЮрЛицам);
		Инициатива.Вставить("ДоступностьФизЛицам",Выборка.ДоступностьФизЛицам);
		Инициатива.Вставить("СрокДо",Выборка.СрокДо);
		Результат.Вставить("КодОтвета", Истина);
		Результат.Вставить("СообщениеОбОшибке", "");
	КонецЦикла;
	ЗаписьJSON = Новый ЗаписьJSON; 
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(); 
	ЗаписьJSON.ОткрытьФайл(ИмяФайлаВыгрузки, , , ПараметрыЗаписи) ; 
	ЗаписатьJSON(ЗаписьJSON, Инициатива); 
	ЗаписьJSON.Закрыть();
	
	ТекстДок = Новый ТекстовыйДокумент();
	ТекстДок.Прочитать(ИмяФайлаВыгрузки,КодировкаТекста.UTF8);
	
	
	Результат.Вставить("Сообщение", ТекстДок.ПолучитьТекст());
	
	Возврат Результат;

	
	
КонецФункции
